{
  "projects":[
  {
    "name": "Moby Thesaurus",
    "description": "moby-thesaurus.org is a free and open-source website designed to facilitate meanderings through the Moby Thesaurus, the largest thesaurus in the English language.",
    "website": "http://moby-thesaurus.org/",
    "keywords": ["language", "English", "thesaurus", "Node.js", "reference"],
    "start": "2014-04-26",
    "end": "2014-04-28"
  },{
    "name": "Ord",
    "description": "Ord is a free and open-source website for translating words into many languages using data from Wikipedia.",
    "website": "http://ord.zeke.xxx/",
    "keywords": ["language", "translation", "Wikipedia", "reference", "Node.js"],
    "start": "",
    "end": ""
  },{
    "name": "Outcasts",
    "description": "Outcasts is a list of words that people on Twitter don't think are words, collected by a bot that searches in tweets for patterns like \"x is not a word\". Favorites include amanzingest, backyardigans, caddywhompers, chuft, cucumbersome, ermahgerd, and flaggergasted.",
    "website": "http://zeke.sikelianos.com/outcasts/",
    "keywords": ["language", "Twitter", "slang", "English", "reference", "Ruby"],
    "start": "2012-04-03",
    "end": "2012-04-03"
  },{
    "name": "Wordnik",
    "description": "Wordnik is a free English language reference site featuring definitions, related words, examples of popular usage, audio pronunciations, and photos. Its data is derived from a variety of sources such as the American Heritage Dictionary, Princeton Wordnet, Wiktionary, Wikipedia, Webster's 1913, and the Century Dictionary, one of the largest encyclopedic dictionaries of the English language. The wordnik.com website is a powered by the Wordnik API, a free and publicly available webservice for building language-based apps and games.",
    "website": "https://wordnik.com/",
    "keywords": ["language", "reference", "English", "Ruby"],
    "start": "",
    "end": ""
  },{
    "name": "New Orleans Street Names",
    "description": "I noticed that New Orleans has lots of nice street names, so I tracked them all down and made a list.",
    "website": "http://new-orleans-street-names.herokuapp.com/",
    "keywords": ["language", "geo"],
    "start": "2014-06-20",
    "end": "2014-06-20"
  },{
    "name": "Arpabet",
    "description": "Arpabet is a webservice for finding rhymes. It uses Carnegie Mellon University Pronouncing Dictionary, a list of over 125,000 words transcribed into Arpabet, a phonetic transcription code developed by Advanced Research Projects Agency (ARPA) as a part of their Speech Understanding Project (1971–1976). It represents each phoneme of General American English with a distinct sequence of ASCII characters.",
    "website": "http://arpabet.herokuapp.com/",
    "keywords": ["language", "words", "rhyme", "reference", "English", "Ruby"],
    "start": "2011-11-15",
    "end": "2013-07-14"
  },{
    "name": "Sniphr",
    "description": "Sniphr is a friction-free bookmarking tool for saving images and snippets of text as you browse the web. It's comprised of a Chrome browser extension and a backing Rails webservice, both of which are open-source on GitHub.",
    "website": "http://sniphr.com/",
    "keywords": ["language", "reference", "Ruby"],
    "start": "2011-04-06",
    "end": "2014-04-15"
  },{
    "name": "semver.io",
    "description": "semver.io is a plaintext and JSON webservice that tracks all available versions of node.js and uses that version info to resolve semver range queries. It's used by Heroku's node buildpack and is open-sourced on GitHub.",
    "website": "https://semver.io/",
    "keywords": ["Node.js", "webservice", "semver", "Heroku"],
    "start": "",
    "end": ""
  },{
    "name": "Swagger",
    "description": "Swagger is a specification and open-source framework for describing, producing, consuming, and visualizing RESTful web services with JSON. I created it as a tool to help make APIs easier to understand and use.",
    "website": "",
    "keywords": [],
    "start": "",
    "end": ""
  }
],
  "jobs": [
    {
      "organization": "Heroku",
      "location": "San Francisco, CA",
      "title": "Product Designer, Node.js Maintainer",
      "description": "Heroku is a platform designed to simplify the once-arduous task of deploying, running, and scaling web applications. I've worn many hats at Heroku, including designer, engineer, product manager, and evangelist. I designed and implemented a full redesign of addons.heroku.com, Heroku's marketplace for cloud infrastructure providers, as well as other web properties like blog.heroku.com and help.heroku.com. For the past year, I've spent most of my time working to improve the Node.js development experience on Heroku, by rewriting the build process from scratch, creating the semver.io microservice for resolving Node versions, writing documentation and blog posts, answering support tickets, and representing the company by speaking at conferences and mentoring at meetups.",
      "website": "http://heroku.com",
      "start": "2012-05-01",
      "end": "Present"
    }, {
      "organization": "Wordnik",
      "location": "San Mateo, CA",
      "title": "Senior Developer",
      "description": "Wordnik is a Bay Area-startup devoted to words and language. While at Wordnik, I designed, built, and maintained the high-traffic wordnik.com website, and also created Swagger, a specification and tool for documenting, visualizing, and experimenting with web-based APIs.",
      "website": "http://wordnik.com",
      "start": "2011-01-01",
      "end": "2012-04-15"
    }, {
      "organization": "Gemini SBS",
      "location": "Los Angeles, CA",
      "title": "Senior Developer",
      "description": "Gemini SBS is a small employee-owned company that builds web-based software for non-proﬁt organizations. During my tenure at Gemini, I designed, coded, and maintained Rails and Sinatra applications and geospatial webservices making use of technologies like Postgres, PostGIS, CouchDB, and the Google Maps Javascript and Flash SDKs.",
      "website": "http://geminisbs.com",
      "start": "2011-01-01",
      "end": "2012-04-15"
    }, {
      "organization": "ELC Technologies",
      "location": "Santa Barbara, CA",
      "title": "Rails Developer",
      "description": "ELC was a Rails development consultancy for Fortune 1000 companies. As a developer at ELC I oversaw the design, development, and maintenance of enterprise-level applications, and was exposed to newly-popularized tenets of so-called agile web development, including pair programming, scrum management and iterative development cycles.",
      "website": "http://elctech.com",
      "start": "2007-01-15",
      "end": "2008-03-31"
    }, {
      "organization": "Ideum",
      "location": "Corrales, NM",
      "title": "Interactive Director",
      "description": "Ideum is a small new media outfit working for museums, educational institutions, nonprofit organizations and socially re- sponsible companies. As Interactive Director, I oversaw the production of a variety of educational and humanitarian pro- jects and worked extensively with Flickr and Google mashups.",
      "website": "http://ideum.com",
      "start": "2006-03-15",
      "end": "2006-11-30"
    }, {
      "organization": "Rome & Gold Creative",
      "location": "Albuquerque, NM",
      "title": "",
      "description": "Rome & Gold Creative is a branding agency working in a wide array of media. I worked as Lead Web Designer/Developer and Junior Print Designer, focusing primarily on developing database-driven websites with content management interfaces, but also doing print, clothing, environmental, and game design.",
      "website": "http://rgcreative.com",
      "start": "2002-08-10",
      "end": "2006-05-05"
    }, {
      "organization": "French Government",
      "location": "L'Isle sur la Sorgue, Provence, France",
      "title": "English Teacher",
      "description": "After studying French in college at UNM, I enrolled in a program to teach English at a public high school in Provence. The program was intended to encourage French students to develop their conversational English skills with native speakers.",
      "website": null,
      "start": "2001-09-20",
      "end": "2002-05-15"
    }, {
      "organization": "Neogenesis Media",
      "location": "Albuquerque, NM",
      "title": "Guru Factotum",
      "description": "Neogenesis was a documentary ﬁlm production house. I worked primarily on post-video editing using Discreet Combustion and After Effects, but also produced interactive CD-ROMs and Flash websites, and developed and maintained a networked rendering farm.",
      "website": "",
      "start": "2000-12-01",
      "end": "2001-09-01"
    }, {
      "organization": "Archetypal 3D",
      "location": "Albuquerque, NM",
      "title": "Web Designer",
      "description": "I worked at this small architectural design firm as a high school student, photographing homes and creating websites to show them off to prospective buyers. The fun part was making panoramic 360-degree IPIX pictures using a camera equipped with a special 190-degree lens for taking twin hemispheric photos to stitch together with software.",
      "website": null,
      "start": "1997-08-01",
      "end": "1999-02-01"
    }
  ],
"schools": [
  {
    "organization": "Beaver Brook",
    "location": "Port Jervis, NY",
    "description": "Beaver Brook is an architectural design and building school located in the woods of upstate New York. I was a student in its inaugural year, during which our ten-person alumni built a sauna.",
    "website": "http://beaverbrook.com/",
    "start": "2013-08-26",
    "end": "2013-09-06"
  }, {
    "organization": "Machine Project",
    "location": "Los Angeles, CA",
    "description": "Beaver Brook is a design and building school in the woods of upstate New York. I was a student in its inaugural year, during which we built a sauna.",
    "website": "http://beaverbrook.com/",
    "start": "2013-08-26",
    "end": "2013-09-06"
    }, {
    "organization": "Santa Barbara City College",
    "location": "Santa Barbara, CA",
    "description": "After a long departure from academia, I willfully attended courses in linguistics and printmaking.",
    "website": "http://sbcc.edu/",
    "started_at": "2008-09-01",
    "ended_at": "2009-05-15"
  }, {
    "organization": "University of New Mexico",
    "location": "Albuquerque, NM",
    "description": "Fresh out of high school, I received a scholarship to attend the univeristy, but after two years of disenchantment, I enrolled in an English teaching program in France and made what was to be my first exodus from academia and the United States.",
    "started_at": "1999-09-05",
    "ended_at": "2001-04-28"
  }
]


}
